app/controllers/clothings_controller.rb

  def index
    @clothings = Clothing.all
---
SELECT "clothings".* FROM "clothings"