app/controllers/weather_forecasts_controller.rb

SELECT "weather_forecasts".* FROM "weather_forecasts"
---
  def index
    @weather_forecasts = WeatherForecast.all

INSERT INTO "weather_forecasts" ("temperature_f", "forecast", "state", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["temperature_f", 60], ["forecast", "sunny"], ["state", "Illinois"], ["city", "Chicago"], ["created_at", "2016-06-08 23:43:26.902356"], ["updated_at", "2016-06-08 23:43:26.902356"]]
---
  def create
    @weather_forecast = WeatherForecast.new
    @weather_forecast.temperature_f = params[:temperature_f]
    @weather_forecast.forecast = params[:forecast]
    @weather_forecast.state = params[:state]
    @weather_forecast.city = params[:city]

    if @weather_forecast.save